questions_for_backend = [
    {
        "text": "Что такое Backend?",
        "options": [
            "A: Дизайн сайта",
            "B: Серверная часть приложения",
            "C: Картинки на странице",
        ],
        "correct_answer": "B"
    },
    {
        "text": "Что такое API?",
        "options": [
            "A: Код на клиенте",
            "B: Интерфейс между приложениями",
            "C: Картинка на сайте",
        ],
        "correct_answer": "B"
    },
    {
        "text": "Что такое база данных?",
        "options": [
            "A: Хранение данных",
            "B: Стили сайта",
            "C: Изображение",
        ],
        "correct_answer": "A"
    },
    {
        "text": "Какой язык программирования чаще всего используется для разработки Backend?",
        "options": [
            "A: HTML",
            "B: Python",
            "C: CSS",
        ],
        "correct_answer": "B"
    },
    {
        "text": "Что делает сервер в Backend?",
        "options": [
            "A: Обрабатывает запросы от клиентов",
            "B: Рисует интерфейс на сайте",
            "C: Хранит картинки для страницы",
        ],
        "correct_answer": "A"
    }
]

questions_for_frontend = [
    {
        "text": "Что такое Frontend?",
        "options": [
            "A: Серверная часть приложения",
            "B: Интерфейс и визуальная часть сайта",
            "C: База данных",
        ],
        "correct_answer": "B"
    },
    {
        "text": "Какие языки чаще всего используют для Frontend?",
        "options": [
            "A: HTML, CSS, JavaScript",
            "B: Python, Java",
            "C: SQL, NoSQL"
        ],
        "correct_answer": "A"
    },
    {
        "text": "Что делает JavaScript на сайте?",
        "options": [
            "A: Добавляет интерактивность и логику на сайте",
            "B: Хранит данные на сервере",
            "C: Создаёт изображения"
        ],
        "correct_answer": "A"
    },
    {
        "text": "Что делает CSS?",
        "options": [
            "A: Определяет стиль и оформление страницы",
            "B: Обрабатывает запросы от клиента",
            "C: Создаёт базу данных"
        ],
        "correct_answer": "A"
    },
    {
        "text": "Что такое HTML?",
        "options": [
            "A: Язык разметки страницы и структуры контента",
            "B: Серверная логика",
            "C: Язык стилей"
        ],
        "correct_answer": "A"
    }
]
