TEXT_START = """
👋 Добро пожаловать!
Это бот академии.
Здесь вы можете узнать о курсах и зарегистрироваться.
Напишите /help чтобы увидеть все команды.
"""

TEXT_HELP = """
📚 Доступные команды:
/start — начать работу с ботом
/about_academy — информация об академии
/about_bot — информация о боте
/help — список команд"
"""

ABOUT_ACADEMY = """
🏫 Наша академия предоставляет современные курсы и обучение, 
направленные на развитие практических навыков и профессионального роста.

Мы помогаем студентам получать качественные знания и готовиться к реальной работе.
"""

ABOUT_BOT = """
🤖 Этот бот создан для удобного взаимодействия с академией.

С его помощью вы можете получать информацию о курсах, 
новостях и других возможностях академии.
"""
