TEXT_START = """
👋 Добро пожаловать!
Это бот академии.
Здесь вы можете узнать о курсах и зарегистрироваться.
Напишите /help чтобы увидеть все команды.
"""

TEXT_HELP = """
📚 Доступные команды:
/start — начать работу с ботом
/about_academy — информация об академии
/about_bot — информация о боте
/help — список команд"
/edit_course - выбрать курс
/admin - админ панель
"""

ABOUT_ACADEMY = """
🏫 Наша академия предоставляет современные курсы и обучение, 
направленные на развитие практических навыков и профессионального роста.

Мы помогаем студентам получать качественные знания и готовиться к реальной работе.
"""

ABOUT_BOT = """
🤖 Этот бот создан для удобного взаимодействия с академией.

С его помощью вы можете получать информацию о курсах, 
новостях и других возможностях академии.
"""

ABOUT_COURSE = """
IT ACADEMY 
Обучаем современным IT-профессиям

Backend Development
Frontend Development

Начни карьеру в IT вместе с нами
"""

ABOUT_EDIT = """
    На какой курс Хотите записаться?
"""

REGISTRATION = """
📝 Регистрация в IT Academy

Пожалуйста, пройдите опрос, чтобы мы могли записать тебя на курсы:

"""
"""
1️⃣ Ф.И.О  
2️⃣ Электронная почта 
3️⃣ Номер телефона  
4️⃣ Курс, на который хочешь записаться (Backend / Frontend / Mobile)
"""

ADMINS = """
⚙ Админ доступ
/view_students - Просмотр всех студентов
/create_new_course - Добавить новый курс
/delete_course - Удалить курс
/update_course - Обновить курс
"""